# Реализовать структуру «Рейтинг», представляющую собой
# не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.
#
# **Подсказка.** Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
#
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].

# "...новый элемент...должен разместиться после них..." - значит,
# просто добавить элемент и сортировать список - не то, что требуется.

my_list = [7, 5, 3, 3, 2]
number = None

while True:
    try:
        number = int(input("Enter natural number >>>"))
        if number >= 0:
            break
    except ValueError:
        continue

if number > my_list[0]:
    my_list.insert(0, number)
else:
    for indx in range(len(my_list) - 1, -1, -1):
        if number <= my_list[indx]:
            my_list.insert(indx + 1, number)
            break
print(my_list)
