# Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки.
# Строки необходимо пронумеровать.
# Если в слово длинное, выводить только первые 10 букв в слове.

# Пользователь может ввести что угодно
word_list = input("Enter an ordinary string >>>").split()
for number, word in enumerate(word_list, 1):
    print(f"{number} {word:.10}")
